"USSD_ERROR" = "Помилка виконання запиту";
"USSD_TERMINATED" = "Сесію завершено";

"%@ Call Forwarding\n%@\n%@%@" = "Переадресація викликів %@\n%@\n%@%@";
"%@ Call Waiting\n%@" = "Очікування викликів %@\n%@";
"%@ Call Barring\n%@\n%@" = "Заборона викликів %@\n%@\n%@";
"%@ Fixed Dialing\n%@" = "Фіксований набір %@\n%@";
"Connected Line Presentation\n%@" = "Представлення з’єднаної лінії\n%@";
"Calling Line Presentation\n%@" = "Представлення лінії виклику\n%@";
"Connected Line ID Restriction\n%@" = "Обмеження ID з’єднаної лінії\n%@";
"Calling Line ID Restriction\n%@" = "Обмеження ID лінії виклику\n%@";
"SIM Lock\n%@" = "Блокування SIM\n%@";
"Service Center Address\n%@" = "Адреса центру обслуговування\n%@";
"Supplementary Service Password\n%@" = "Додатковий пароль послуги\n%@";
"Calling Name Presentation\n%@" = "Представлення лінії виклику\n%@";

"Forwards to %@\n" = "Переадресувати до %@\n";

"All Calls" = "Усі виклики";
"All Conditional Calls" = "Усі умовні виклики";
"Async Data Circuit" = "Ланцюг асинхронних даних";
"Data" = "Дані";
"Fax" = "Факс";
"Packet Access" = "Пакетний доступ";
"Pad Access" = "Доступ PAD";
"SMS" = "SMS";
"Sync Data Circuit" = "Ланцюг синхронних даних";
"Voice" = "Голос";

"All Outgoing" = "Усі вихідні";
"All Incoming" = "Усі вхідні";
"Outgoing International" = "Міжнародні вихідні";
"Outgoing International, Except Home Country" = "Міжнародні вихідні, виключаючи країну мешкання";
"Incoming While Roaming Outside Home Country" = "Вхідні у закордонному роумінгу";
"Incoming, Not On SIM" = "Вхідні не через SIM-карту";
"All Services" = "Усі послуги";
"All Outgoing Services" = "Усі вихідні послуги";
"All Incoming Services" = "Усі вхідні послуги";

"Disabled" = "Вимкнено";
"Enabled" = "Увімкнено";

"On All Calls" = "Під час всіх викликів";
"When Busy" = "Коли зайнято";
"When Unanswered" = "Коли немає відповіді";
"When Unreachable" = "Коли недосяжний";

"Setting %@ Succeeded" = "%@ успішно задано\n";
"Setting Interrogation Succeeded" = "Обмін даними успішно задано\n";
"Setting %@ Failed" = "Помилка параметра %@\n";
"Setting Interrogation Failed" = "Помилка встановлення обміну даними\n";

"Not Available" = "Недоступно";
"Network Controlled" = "Контролюється мережею";
"Temporarily Disabled" = "Тимчасово вимкнено";
"Temporarily Enabled" = "Тимчасово увімкнено";
"Unknown" = "Невідомо";

"Activation" = "Активація";
"Deactivation" = "Деактивація";
"Interrogation" = "Обмін даними";
"Registration" = "Реєстрація";
"Erasure" = "Стирання";

"No Address" = "Немає адреси";
"No Service Specified" = "Службу не зазначено";
"Type %d" = "Тип %d";

// generic error
"CALL_FAILED" = "Помилка виклику";
// error codes
"kCTNoError" = "Усе гаразд";
"kCTUnknownError" = "Невідома помилка";
"kCTErrorRadioFailure" = "Помилка радіоканалу";
// Generic network errors
"kCTErrorNetworkFailure" = "Помилка мережі";
"kCTErrorCongestion" = "Мережа перевантажена";
"kCTErrorUnidentifiedSubscriber" = "Невизначений абонент";
"kCTErrorFacilityRejected" = "Запит на устаткування чи послугу відхилено";
"kCTErrorUnknownSubscriber" = "Невідомий абонент";
"kCTErrorNetworkOutOfOrder" = "Мережа не функціонує";
"kCTErrorInvalidTransactionIdentifier" = "Неправильний ідентифікатор транзакції";
"kCTErrorSemanticallyIncorrectMessage" = "Неправильна семантика повідомлення";
"kCTErrorInvalidMandatoryInformation" = "Неправильна обов’язкова інформація";
"kCTErrorMessageTypeNonExistant" = "Нерозпізнаний тип повідомлення";
"kCTErrorMessageNotCompatibleWithProtocolState" = "Повідомлення не відповідає стану протоколу";
"kCTErrorInformationElementNonExistant" = "Неіснуючий інформаційний елемент";
"kCTErrorProtocolErrorUnspecified" = "Невідома помилка протоколу";
"kCTErrorTemporaryFailure" = "Тимчасова помилка";
"kCTErrorResourcesUnavailable" = "Ресурси недоступні";
"kCTErrorRequestedFacilityNotSubscribed" = "Немає передплати на запитану послугу";
"kCTErrorRequestedFacilityNotImplemented" = "Запитана послуга не реалізована";
"kCTErrorInterworkingError" = "Помилка міжмережевого обміну";
"kCTErrorInterworkingNotSupported" = "Міжмережевий обмін не підтримується";
"kCTErrorCommandCannotBeActioned" = "Не вдається виконати команду";
"kCTErrorNoNetworkService" = "Немає покриття";
// Call related errors
"kCTErrorUnassignedNumber" = "Непризначений номер";
"kCTErrorOperatorDeterminedBarring" = "Оператор виявив заборону виклику";
"kCTErrorCallBarred" = "Виклик заборонено";
"kCTErrorUserBusy" = "Абонент зайнятий";
"kCTErrorNoUserResponding" = "Абонент не відповідає";
"kCTErrorNumberChanged" = "Номер змінився";
"kCTErrorInvalidNumberFormat" = "Неправильний формат номера";
"kCTErrorCallRejected" = "Виклик відхилено";
// SIM errors
"kCTErrorSimNotInserted" = "Відсутня SIM-карта";
"kCTErrorSimPinRequired" = "Потрібний PIN-код SIM-карти";
"kCTErrorSimPukRequired" = "Потрібний PUK-код SIM-карти";
"kCTErrorSimFailure" = "Помилка SIM";
"kCTErrorSimMemoryFailure" = "Помилка пам’яті SIM-карти";
"kCTBadPinFormatError" = "Неправильний формат PIN";
"kCTErrorNumberNotAllowed" = "Номер заборонено";
"kCTErrorIncorrectPassword" = "Неправильний пароль";
// SMS Errors
"kCTErrorShortMessageTransferRejected" = "Запит на передавання короткого повідомлення відхилено";
"kCTErrorDestinationOutOfOrder" = "Неполадка на боці адресата";
"kCTErrorClass0NotSupported" = "Клас 0 не підтримується";
"kCTErrorCannotReplaceSm" = "Не вдається замінити SIM";
"kCTErrorUnspecifiedPid" = "Невизначений PID";
"kCTErrorDataCodingSchemeNotSupported" = "Схема кодування даних не підтримується";
"kCTErrorUnspecifiedDcs" = "Невизначена помилка DCS";
"kCTErrorCommandUnsupported" = "Команда не підтримується";
"kCTErrorUnspecifiedTpCommand" = "Невизначена помилка команди TP";
"kCTErrorTpduNotSupported" = "TPDU не підтримується";
"kCTErrorScBusy" = "SC зайнятий";
"kCTErrorRejectedBySimSmsControl" = "Відхилено службою контролю SIM SMS";
// GPRS Errors
"kCTErrorGprsIllegalMs" = "GPRS: неправильний MS";
"kCTErrorGprsIllegalMe" = "GPRS: неправильний ME";
"kCTErrorGprsServicesNotAllowed" = "Послуги GPRS не дозволені";
"kCTErrorGprsPlmnNotAllowed" = "GPRS PLMN не дозволено";
"kCTErrorGprsLocationAreaNotAllowed" = "Місцевість GPRS не дозволена";
"kCTErrorGprsRoamingNotAllowedInLocationArea" = "Роумінг GPRS не дозволено в цій місцевості";
"kCTErrorGprsServiceOptionNotSupported" = "Опція послуг GPRS не підтримується";
"kCTErrorGprsServiceOptionNotSubscribed" = "Немає передплати на опцію послуг GPRS";
"kCTErrorGprsServiceOptionTemporarilyOutOfOrder" = "Опція послуг GPRS тимчасово не функціонує";
"kCTErrorGprsPdpAuthenticationFailure" = "Помилка автентифікації GPRS PDP";
"kCTErrorGprsInvalidMobileClass" = "GPRS: неправильний мобільний клас";
"kCTErrorGprsUnspecified" = "GPRS: невизначена помилка";
"kCTErrorGprsMissingorUnknownAPN" = "GPRS недоступний або невідома точка доступу";
"kCTErrorGprsPDPAuthenticationInfoRejectedByBaseband" = "Дані автентифікації GPRS PDP відхилено під час прямого передавання";
